import React from "react";
import { Container, Box, Center, Text, ListItem, List} from "@chakra-ui/react";
import Header from "../components/Header";

const PrivacyPolice = () => {
  return (
    <>
      <Header />
      <Box as='section' p='50px' color='rgba(0, 90, 78, 1)'>
        <Container maxW='8xl'>
          <Center>
            <Text as='h2' margin='50px 0' textStyle='heading-small'>
              Политика конфиденциальности
            </Text>
          </Center>
          <Text textStyle='body-small'>
            Политика конфиденциальности NeoBazzar разработала настоящую Политику
            конфиденциальности в соответствии с обязательствами NeoBazzar по
            обеспечению конфиденциальности на веб-сайтах и маркетинговых
            инициативах NeoBazzar. Ниже описаны методы сбора, распространения и
            защиты информации NeoBazzar.  Согласие Если вы не согласны с
            условиями настоящей Политики конфиденциальности, пожалуйста, не
            заходите на веб-сайт NeoBazzar и не используйте его. Если вы хотите
            отказаться от получения маркетинговых материалов NeoBazzar, нажмите
            кнопку «Отписаться» в маркетинговом письме, которое вы получили от
            нас. Сбор информации NeoBazzar собирает информацию для
            предоставления более качественных услуг своим пользователям, а также
            для лучшего понимания посетителей своего веб-сайта и того, какой
            контент представляет для них интерес. NeoBazzar собирает информацию
            следующими способами: информация, которую вы предоставляете нам
            (например, адрес электронной почты,) с целью доступа к различным
            загрузкам, просмотра определенного контента, подписки на новостную
            рассылку NeoBazzar, регистрации ваших предпочтений в получении
            маркетинговых материалов от NeoBazzar, а также ваших предпочтений в
            отношении связи и т. д.; информация, которую NeoBazzar получает в
            результате использования вами веб-сайта NeoBazzar, такая как
            IP-адрес, тип браузера, интернет-провайдер, страницы
            перехода/выхода, тип платформы, отметка даты/времени, количество
            кликов, доменное имя и страна/штат всех посетителей веб-сайта
            NeoBazzar; информацию о местонахождении при использовании веб-сайта
            NeoBazzar, поскольку NeoBazzar может собирать и обрабатывать
            информацию о вашем местоположении. NeoBazzar использует различные
            технологии и инструменты для определения местоположения; информация,
            которая считается агрегированными данными, такими как статистические
            или демографические данные, которые NeoBazzar может использовать в
            любых целях. Агрегированные данные могут быть получены из ваших
            персональных данных, но не считаются персональными данными по
            закону, поскольку они прямо или косвенно не раскрывают вашу
            личность, за исключением случаев, когда NeoBazzar объединяет или
            связывает агрегированные данные с вашими персональными данными таким
            образом, чтобы они могли прямо или косвенно идентифицировать вас; и
            NeoBazzar будет использовать вашу персональную информацию только в
            тех целях, для которых она была собрана, за исключением случаев,
            когда она обоснованно считает, что ей необходимо использовать ее по
            другой причине, совместимой с первоначальной целью. Если NeoBazzar
            потребуется использовать Ваши персональные данные в целях, не
            связанных с этим, NeoBazzar уведомит Вас об этом и разъяснит
            правовую основу, позволяющую NeoBazzar это сделать. Обмен
            информацией NeoBazzar может раскрывать ваши персональные данные
            следующим категориям получателей: любому компетентному
            правоохранительному органу, регулирующему органу, государственному
            органу, суду или другой третьей стороне, если NeoBazzar считает, что
            раскрытие информации необходимо (а) в соответствии с применимым
            законодательством или нормативными актами, (б) для осуществления,
            установления или защиты своих законных прав или (в) для защиты своих
            жизненно важных интересов или жизненно важных интересов любого
            другого лица. любому другому лицу с вашего согласия на раскрытие
            информации. Правовая основа обработки данных Если ваши персональные
            данные защищены законодательством ЕС о защите данных, правовая
            основа NeoBazzar для сбора и использования персональных данных,
            описанных выше, будет зависеть от соответствующих персональных
            данных и конкретного контекста, в котором NeoBazzar их собирает. Тем
            не менее, NeoBazzar, как правило, собирает ваши персональные данные
            только (а) в тех случаях, когда персональные данные необходимы для
            исполнения договора с вами, (б) если обработка отвечает его законным
            интересам и не противоречит вашим правам, или (в) если у него есть
            ваше согласие на это. В некоторых случаях NeoBazzar также может
            иметь юридическое обязательство по сбору ваших персональных данных
            или иным образом может нуждаться в персональных данных для защиты
            ваших жизненно важных интересов или жизненно важных интересов
            другого лица. Если у вас есть вопросы или вам нужна дополнительная
            информация о правовых основаниях, на которых NeoBazzar собирает и
            использует ваши персональные данные, пожалуйста, свяжитесь с
            NeoBazzar, используя контактную информацию, указанную в разделе
            «Контактная информация» ниже и в правой колонке. Использование
            информации Любая информация, собираемая NeoBazzar, будет
            осуществляться в соответствии с настоящей Политикой
            конфиденциальности в целях принятия более эффективных
            бизнес-решений, поддержки выбранных вами видов деятельности.
            NeoBazzar использует информацию о вашем товаре, чтобы адаптировать
            ваш опыт работы с веб-сайтами NeoBazzar. Он также может использовать
            любую неличную информацию, собранную для улучшения веб-сайтов
            NeoBazzar, а также ваш IP-адрес для диагностики и администрирования
            веб-сайтов. NeoBazzar будет хранить ваши персональные данные только
            до тех пор, пока это необходимо для достижения целей, для которых
            они были собраны, в том числе для выполнения любых юридических,
            бухгалтерских или отчетных требований. Для определения надлежащего
            срока хранения персональных данных NeoBazzar учитывает объем,
            характер и конфиденциальность персональных данных, потенциальный
            риск причинения вреда в результате несанкционированного
            использования или раскрытия персональных данных, цели, в которых
            NeoBazzar обрабатывает персональные данные, и возможность достижения
            этих целей другими способами, а также применимые требования
            законодательства. Международная передача данных NeoBazzar
            обрабатывает информацию на серверах во многих странах мира, и вы
            даете согласие на обработку ваших персональных данных на сервере,
            расположенном за пределами страны, в которой вы проживаете. В этих
            странах могут действовать законы о защите данных, которые отличаются
            от законов вашей страны (а в некоторых случаях могут быть не такими
            защитными). Тем не менее, NeoBazzar приняла надлежащие меры
            предосторожности для обеспечения защиты ваших персональных данных в
            соответствии с настоящей Политикой конфиденциальности, в том числе с
            использованием Стандартных договорных условий Европейской комиссии
            для передачи персональных данных между компаниями группы, которые
            требуют, чтобы все компании группы защищали персональные данные,
            обрабатываемые из Европейской экономической зоны, в соответствии со
            стандартом, эквивалентным тому, который требуется в соответствии с
            законодательством Европейского Союза о защите данных. Информационная
            безопасность NeoBazzar защищает ваши персональные данные так же, как
            и другие свои конфиденциальные данные, например, хранит их на
            защищенных серверах, доступ к которым имеют только избранные
            сотрудники NeoBazzar, и шифрует их для предотвращения
            несанкционированного доступа. NeoBazzar внедрила процедуры для
            борьбы с любыми нарушениями персональных данных и уведомит вас и
            любой соответствующий регулирующий орган о нарушении, когда это
            требуется по закону. Маркетинг Как объяснялось выше, NeoBazzar будет
            собирать и использовать ваши персональные данные в маркетинговых
            целях. Ваши данные будут храниться в нашей системе. Мы будем
            использовать Ваши данные для информирования Вас о продуктах и
            услугах NeoBazzar, которые, по нашему мнению, могут Вас
            заинтересовать. В статистических целях мы будем собирать информацию
            о вашем ответе на наши электронные письма и нашем взаимодействии с
            вами для принятия решений о будущем маркетинге. Если вы хотите
            прекратить сбор и использование этой информации, свяжитесь
            с privacy@neobazzar.com. Ссылки Веб-сайты NeoBazzar содержат ссылки,
            плагины и приложения на различные сторонние веб-сайты. Переход по
            этим ссылкам или включение этих соединений может позволить третьим
            лицам собирать или передавать данные о вас. NeoBazzar не
            контролирует и не несет ответственности за содержание, политику
            конфиденциальности или надежность таких сторонних подключений. Когда
            вы покидаете веб-сайт NeoBazzar, NeoBazzar рекомендует вам
            ознакомиться с уведомлением о конфиденциальности и политикой
            конфиденциальности каждого веб-сайта, который вы посещаете. Ваши
            права на защиту данных Если ваши персональные данные защищены
            законодательством ЕС о защите данных, у вас есть следующие права на
            защиту данных, которыми вы можете воспользоваться, связавшись с
            NeoBazzar, используя контактную информацию, указанную в разделе
            «Контактные данные» ниже и в правой колонке: Если вы
            хотите запросить удаление вашей личной информации, вы можете сделать
            это в настройках своего профиля на http://www.neobazzar.com/. Если
            вы хотите получить доступ к своим персональным данным, исправить
            их, обновить их, вы можете сделать это в любое время, связавшись с
            NeoBazzar Кроме того, Вы можете возразить против обработки Ваших
            персональных данных, попросить NeoBazzar ограничить обработку Ваших
            персональных данных или запросить перенос Ваших персональных данных,
            связавшись с NeoBazzar. Вы имеете право в любое время отказаться от
            маркетинговых сообщений, которые вам отправляет NeoBazzar. Вы можете
            воспользоваться этим правом, перейдя по ссылке «отписаться» или
            «отказаться» в маркетинговых письмах, которые NeoBazzar отправляет
            вам, или воспользовавшись соответствующим механизмом отказа для
            маркетинга, не основанного на электронной почте. Аналогичным
            образом, если NeoBazzar собрала и обрабатывает ваши персональные
            данные на основании вашего согласия, вы можете отозвать свое
            согласие в любое время. Отзыв Вашего согласия не повлияет на
            законность любой обработки NeoBazzar, выполненной до Вашего отзыва,
            а также не повлияет на обработку Ваших персональных данных,
            осуществляемую на законных основаниях, отличных от согласия. Вы
            имеете право подать жалобу в орган по надзору за соблюдением
            законодательства о защите персональных данных в связи со сбором и
            использованием NeoBazzar ваших персональных данных. Для получения
            дополнительной информации обратитесь в местный орган по надзору за
            соблюдением законодательства о защите персональных данных. Вам не
            придется платить за доступ к вашей личной информации (или за
            осуществление любых других прав). Тем не менее, NeoBazzar может
            взимать разумную плату или отказывать в выполнении вашего запроса,
            если ваш запрос является явно необоснованным, повторяющимся или
            чрезмерным. NeoBazzar старается отвечать на все законные запросы в
            течение одного месяца. Иногда это может занять больше времени, если
            ваш запрос особенно сложный или вы сделали несколько запросов. В
            этом случае NeoBazzar уведомит вас об этом и будет держать вас в
            курсе. Cookies  Вы можете настроить свой браузер таким образом,
            чтобы он отклонял все или некоторые файлы cookie браузера или
            предупреждал вас, когда веб-сайты устанавливают файлы cookie или
            получают доступ к ним. Если вы отключите файлы cookie или откажетесь
            от них, некоторые части сайтов NeoBazzar могут стать недоступными
            или работать неправильно. Более подробную информацию о файлах
            cookie, используемых NeoBazzar можно найти в Политике NeoBazzar в
            отношении файлов cookie. Изменения в Политике NeoBazzar оставляет за
            собой право время от времени изменять или дополнять настоящую
            Политику конфиденциальности по своему усмотрению. С изменениями
            можно ознакомиться здесь или на сайтах NeoBazzar. Если вы
            продолжаете пользоваться сайтами NeoBazzar, это означает, что вы
            принимаете эти изменения. Эта версия последний раз обновлялась 12
            апреля 2024 года, а предыдущие версии можно получить, связавшись с
            NeoBazzar. Контактная информация Важно, чтобы персональные данные о
            вас, хранящиеся в NeoBazzar, были точными и актуальными. Пожалуйста,
            информируйте NeoBazzar, если ваши персональные данные изменятся в
            ходе ваших отношений с NeoBazzar. Кроме того, если у вас есть
            какие-либо вопросы о настоящей Политике конфиденциальности, практике
            работы веб-сайта NeoBazzar или вашем взаимодействии с NeoBazzar
            через веб-сайт NeoBazzar, пожалуйста, обращайтесь:
            NeoBazzar@Email: privacy@neobazzar.com
          </Text>
          <List textStyle="body-large" display="flex" flexDirection="column" gap={2} color="black" margin="30px 0 0">
            <ListItem>Minsk</ListItem>
            <ListItem>Nezavisimosti proospect, 21 </ListItem>
            <ListItem>220095, Minsk, Belarus </ListItem>
            <ListItem>Phone: +37529 2144897</ListItem>
          </List>
        </Container>
      </Box>
    </>
  );
};

export default PrivacyPolice;
