import React from "react";
import { Center, Text, Box, Container } from "@chakra-ui/react";
import Header from "../components/Header";

const TermsOfService = () => {
  return (
    <>
      <Header />
      <Box as='section' p='50px' color="rgba(0, 90, 78, 1)">
        <Container maxW='8xl'>
          <Center>
            <Text
              as='h2'
              margin='50px 0'
              textStyle='heading-small'>
              Условия использования
            </Text>
          </Center>
          <Text textStyle="body-small">
            Настоящие Условия использования (далее – «Соглашение») приняты
            NeoBazzar (юридический адрес:…….; почтовый адрес:…….) (далее —
            «Компания») и действуют в отношении http://www.neobazzar.com/
            вебсайта, брендированных страниц на других платформах, мобильных и
            других приложений, используемых для работы с такими вебсайтами и
            других платформ (далее – «Платформа»), которые управляются
            непосредственно Компанией или по ее поручению. Продолжая регистрацию
            или используя Платформу, Вы автоматически принимаете данное
            Соглашение. В случае любых проблем и жалоб Вы соглашаетесь и
            обязуетесь постараться решить их сначала в досудебном порядке путем
            обращения на privacy@neobazzar com email адрес. Контент Вы
            ответственны за собственный создаваемый «Контент», включая любую
            информацию, материалы или любое другой контент, публикуемый Вами на
            Платформе. Ваш Контент должен соответствовать данному Соглашению,
            этическим нормам и законам. Являясь ответственными за Ваш Контент,
            вы соглашаетесь, помимо прочего, что: — У Вас есть все необходимые
            разрешения, права и лицензии, необходимые для работы с данными
            Контентом, размещения их на Платформе или передаче в Компанию; — Ваш
            Контент не включает персональные, приватные или конфиденциальную
            информацию, принадлежащую другим; — Ваш Контент не нарушает права
            любого физического или юридического лица; — Запрещается создавать
            Контент, на Платформе в целях получения доступа к персональным
            данным посетителей Платформы для проведения каких-либо сторонних
            мероприятий, направленных на предложение заключения
            гражданско-правовых договоров с пользователями Платформы, а также
            предполагающих взаимодействие с пользователями Платформы, итоговой
            целью которого является привлечение пользователей Платформы в
            качестве работников и/или подрядчиков в какую-либо организацию,
            заключение трудового или гражданско-правового договора с
            пользователями Платформы.  Мы не требуем передачи нам в
            собственность Вашего Контента. Однако, для обеспечения
            функционирования Платформы, ее улучшений, продвижения, рекламы, а
            также для защиты Компании и Платформы Вы предоставляете Компании
            неисключительное, всемирное, бессрочное, безотзывное, бесплатное,
            сублицензируемое, передаваемое право и лицензию (включая отказ от
            любых моральных прав) на использование, размещение, хранение,
            воспроизведение, изменение, публикацию, публичную демонстрацию,
            распространение и создание производного Контента, а также
            использование (в том числе коммерческое) авторских прав, торговых
            марок, прав на рекламу и на базы данных, которые вы имеете в
            отношении своего Контента. Эта лицензия позволит вашему Контенту
            оставаться на Платформе даже после того, как вы перестанете быть
            членом Компании или Платформы. Мы не отвечаем за Контент,
            публикуемый пользователями Платформы. Мы не премодерируем весь
            Контент. Если Вы обнаружили Контент, которые нарушает настоящее
            Соглашение, пожалуйста сообщите нам по адресу privacy@neobazzar.com.
            Персональные данные Компания собирает регистрационную и прочую
            информацию о Вас, собираемую при помощи Платформы. Пожалуйста,
            ознакомьтесь со следующими документами для того, чтобы подробнее
            узнать о том, какие данные и зачем мы собираем: Положение об
            обработке персональных данных, Политика конфиденциальности, Согласие
            на обработку. Продолжая регистрацию или использование Платформы, Вы
            соглашаетесь со всеми вышеперечисленными правилами. Обратите
            внимание, что данные правила и документы не оговаривают
            использование информации организаторами мероприятий, лидерами
            сообществ и другими пользователями Платформы. Использование
            Платформы Вы соглашаетесь, что Вы ни прямо ни косвенно не будете (а)
            извлекать данные из Платформы для коммерческих нужд без разрешения
            данным Соглашением автоматическими методами, либо при помощи третьих
            лиц, либо другими методами; (б) производить любые действия,
            наносящие вред, повреждая или перегружая данными или запросами
            Платформу. Вы обязуетесь использовать, хранить и обрабатывать
            персональные данные, собираемые через Платформу, в соответствии с
            законом, этическими и моральными принципами. Вы обязуетесь сообщать
            пользователям Платформы, данные которых Вы обрабатываете или
            владеете, о Ваших действиях с этими данными и обязуетесь
            обрабатывать запросы от этих пользователей, связанные с их данными.
            Также вы обязуетесь надежно хранить и защищать данные от
            неавторизованного доступа, обработки, а также удалять их как только
            исчезает необходимость, в рамках которой собирались эти данные, либо
            по запросу представителей Платформы. Использование Платформы
            сопряжено с взаимодействиями с реальными людьми и выполнением
            реальных действий в реальном мире, что может привести к
            непредвиденным ситуациям. Мы не можем контролировать то, что
            происходит за пределами Платформы и мы не несем ответственности за
            это. Вы должны руководствоваться здравым смыслом при взаимодействии
            с другими пользователями Платформы. Также Платформа не контролирует
            поведение пользователей, поэтому Платформа не несет ответственности
            за их действия. Если Вы обнаружили поведение, нарушающее данное
            Соглашение, этические нормы или закон, пожалуйста свяжитесь с нами
            по email privacy@neobazzar.com. Разрешение споров Перед подачей
            претензии, Вы и Компания соглашаетесь попытаться разрешить любые
            споры путем диалога. Мы используем термин «претензия» в этом
            параграфе для обозначения любых споров, претензий или разногласий,
            возникающих или связанных с использованием Вами нашей Платформы или
            настоящего Соглашения, включая Ваше участие в мероприятиях
            Платформы. Вы или Компания можете инициировать этот процесс,
            отправив письменное уведомление с описанием проблемы и предложенного
            решения. Главный контакт для этих целей на стороне Компании -
            email адрес privacy@neobazzar.com. Если мы не сможем решить проблему
            в течение 30 рабочих дней после получения сообщения и подтверждения
            о его получении, Вы или Компания можете обратиться в суд.
            Интеллектуальная собственность Торговые марки Компании, логотипы,
            зарегистрированные имена и названия являются интеллектуальной
            собственностью Компании. Наша Платформа, включая материалы на
            Платформе, также являются нашей интеллектуальной собственностью,
            либо собственностью наших лицензиаров. Вы обязуетесь не использовать
            нашу интеллектуальную собственность без нашего письменного
            разрешения. Компания уважает чужую интеллектуальную собственность и
            мы ожидаем такого же поведения от наших пользователей. При
            определенных обстоятельствах и на наше усмотрение мы можем удалить
            или ограничить доступ к материалам, которые на наш взгляд могут
            нарушать или посягать на интеллектуальную собственность других лиц.
            Также мы можем удалить или ограничить доступ на Платформу тем, кто
            повторяет данные нарушения. Если Вы считаете, что Ваши права на
            интеллектуальную собственность были нарушены, пожалуйста свяжитесь с
            нами по email privacy@neobazzar.com. Изменения в Условиях
            использования и Платформе Мы можем менять текст данного Соглашения.
            Когда мы делаем это, мы будем публиковать новую версию на этой
            странице и отправлять уведомления на Ваш email. Продолжая
            использование Платформы после любых изменений Соглашения, Вы
            соглашаетесь с изменениями в Соглашении. Если Вы не хотите принять
            изменения в Соглашении, Вы можете удалить Ваш аккаунт. Мы постоянно
            улучшаем Платформу. Это означает, что мы можем добавлять новый или
            отключать старый функционал Платформы по собственному усмотрению и
            без уведомления пользователей. Используя Платформу, вы принимаете
            это.
          </Text>
        </Container>
      </Box>
    </>
  );
};

export default TermsOfService;
